In [1]:
import pandas as pd

In [8]:
df=pd.read_csv("com.csv")
#df1=pd.read_csv('http://13.234.66.67/summer19/datasets/info.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name          6 non-null object
Department    4 non-null object
Manager       4 non-null object
Salary        6 non-null int64
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [10]:
#df1.info()

In [11]:
#to print all the data
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [12]:
#top two rows
df.head(3)

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100

In [14]:
df.tail(2)

            Name Department      Manager  Salary
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [21]:
#one particular column
df['Name'],df['Department']

(0    NaN
 1    Bar
 2    Foo
 3    Foo
 4    NaN
 5    Foo
 Name: Name, dtype: object, 0    NaN
 1    Bar
 2    Foo
 3    Foo
 4    NaN
 5    Foo
 Name: Department, dtype: object)

In [22]:
#for selecting rows and columns
df.iloc[0:,0]

0    NaN
1    Bar
2    Foo
3    Foo
4    NaN
5    Foo
Name: Name, dtype: object

In [23]:
df.iloc[0:,[1,3]]

  Department  Salary
0        NaN     200
1        Bar      50
2        Foo     100
3        Foo     100
4        NaN     250
5        Foo      50

In [27]:
df['Salary'].max()

250

df['salary'].min()

In [28]:
df['Salary'].mean()

125.0

In [30]:
df['Salary'].sum()

750

In [31]:
df.values

array([[nan, nan, nan, 200],
       ['Bar', 'Bar', 'Friar Tuck', 50],
       ['Foo', 'Foo', 'Robin Hood', 100],
       ['Foo', 'Foo', 'Robin Hood', 100],
       [nan, nan, nan, 250],
       ['Foo', 'Foo', 'Little John', 50]], dtype=object)

In [38]:
df.values[3][1]

'Foo'